// Generated by jextract

package net.babelsoft.negatron.io.event.input;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;
import net.babelsoft.negatron.io.Gamepad;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct SDL_TouchFingerEvent {
 *     SDL_EventType type;
 *     Uint32 reserved;
 *     Uint64 timestamp;
 *     SDL_TouchID touchID;
 *     SDL_FingerID fingerID;
 *     float x;
 *     float y;
 *     float dx;
 *     float dy;
 *     float pressure;
 *     SDL_WindowID windowID;
 * }
 * }
 */
public class SDL_TouchFingerEvent {

    SDL_TouchFingerEvent() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(Gamepad.C_INT.withName("type"),
        Gamepad.C_INT.withName("reserved"),
        Gamepad.C_LONG_LONG.withName("timestamp"),
        Gamepad.C_LONG_LONG.withName("touchID"),
        Gamepad.C_LONG_LONG.withName("fingerID"),
        Gamepad.C_FLOAT.withName("x"),
        Gamepad.C_FLOAT.withName("y"),
        Gamepad.C_FLOAT.withName("dx"),
        Gamepad.C_FLOAT.withName("dy"),
        Gamepad.C_FLOAT.withName("pressure"),
        Gamepad.C_INT.withName("windowID")
    ).withName("SDL_TouchFingerEvent");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SDL_EventType type
     * }
     */
    public static final OfInt type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SDL_EventType type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SDL_EventType type
     * }
     */
    public static int type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SDL_EventType type
     * }
     */
    public static void type(MemorySegment struct, int fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final OfInt reserved$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reserved"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Uint32 reserved
     * }
     */
    public static final OfInt reserved$layout() {
        return reserved$LAYOUT;
    }

    private static final long reserved$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Uint32 reserved
     * }
     */
    public static final long reserved$offset() {
        return reserved$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Uint32 reserved
     * }
     */
    public static int reserved(MemorySegment struct) {
        return struct.get(reserved$LAYOUT, reserved$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Uint32 reserved
     * }
     */
    public static void reserved(MemorySegment struct, int fieldValue) {
        struct.set(reserved$LAYOUT, reserved$OFFSET, fieldValue);
    }

    private static final OfLong timestamp$LAYOUT = (OfLong)$LAYOUT.select(groupElement("timestamp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Uint64 timestamp
     * }
     */
    public static final OfLong timestamp$layout() {
        return timestamp$LAYOUT;
    }

    private static final long timestamp$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Uint64 timestamp
     * }
     */
    public static final long timestamp$offset() {
        return timestamp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Uint64 timestamp
     * }
     */
    public static long timestamp(MemorySegment struct) {
        return struct.get(timestamp$LAYOUT, timestamp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Uint64 timestamp
     * }
     */
    public static void timestamp(MemorySegment struct, long fieldValue) {
        struct.set(timestamp$LAYOUT, timestamp$OFFSET, fieldValue);
    }

    private static final OfLong touchID$LAYOUT = (OfLong)$LAYOUT.select(groupElement("touchID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SDL_TouchID touchID
     * }
     */
    public static final OfLong touchID$layout() {
        return touchID$LAYOUT;
    }

    private static final long touchID$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SDL_TouchID touchID
     * }
     */
    public static final long touchID$offset() {
        return touchID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SDL_TouchID touchID
     * }
     */
    public static long touchID(MemorySegment struct) {
        return struct.get(touchID$LAYOUT, touchID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SDL_TouchID touchID
     * }
     */
    public static void touchID(MemorySegment struct, long fieldValue) {
        struct.set(touchID$LAYOUT, touchID$OFFSET, fieldValue);
    }

    private static final OfLong fingerID$LAYOUT = (OfLong)$LAYOUT.select(groupElement("fingerID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SDL_FingerID fingerID
     * }
     */
    public static final OfLong fingerID$layout() {
        return fingerID$LAYOUT;
    }

    private static final long fingerID$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SDL_FingerID fingerID
     * }
     */
    public static final long fingerID$offset() {
        return fingerID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SDL_FingerID fingerID
     * }
     */
    public static long fingerID(MemorySegment struct) {
        return struct.get(fingerID$LAYOUT, fingerID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SDL_FingerID fingerID
     * }
     */
    public static void fingerID(MemorySegment struct, long fieldValue) {
        struct.set(fingerID$LAYOUT, fingerID$OFFSET, fieldValue);
    }

    private static final OfFloat x$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("x"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float x
     * }
     */
    public static final OfFloat x$layout() {
        return x$LAYOUT;
    }

    private static final long x$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float x
     * }
     */
    public static final long x$offset() {
        return x$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float x
     * }
     */
    public static float x(MemorySegment struct) {
        return struct.get(x$LAYOUT, x$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float x
     * }
     */
    public static void x(MemorySegment struct, float fieldValue) {
        struct.set(x$LAYOUT, x$OFFSET, fieldValue);
    }

    private static final OfFloat y$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("y"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float y
     * }
     */
    public static final OfFloat y$layout() {
        return y$LAYOUT;
    }

    private static final long y$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float y
     * }
     */
    public static final long y$offset() {
        return y$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float y
     * }
     */
    public static float y(MemorySegment struct) {
        return struct.get(y$LAYOUT, y$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float y
     * }
     */
    public static void y(MemorySegment struct, float fieldValue) {
        struct.set(y$LAYOUT, y$OFFSET, fieldValue);
    }

    private static final OfFloat dx$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("dx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float dx
     * }
     */
    public static final OfFloat dx$layout() {
        return dx$LAYOUT;
    }

    private static final long dx$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float dx
     * }
     */
    public static final long dx$offset() {
        return dx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float dx
     * }
     */
    public static float dx(MemorySegment struct) {
        return struct.get(dx$LAYOUT, dx$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float dx
     * }
     */
    public static void dx(MemorySegment struct, float fieldValue) {
        struct.set(dx$LAYOUT, dx$OFFSET, fieldValue);
    }

    private static final OfFloat dy$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("dy"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float dy
     * }
     */
    public static final OfFloat dy$layout() {
        return dy$LAYOUT;
    }

    private static final long dy$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float dy
     * }
     */
    public static final long dy$offset() {
        return dy$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float dy
     * }
     */
    public static float dy(MemorySegment struct) {
        return struct.get(dy$LAYOUT, dy$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float dy
     * }
     */
    public static void dy(MemorySegment struct, float fieldValue) {
        struct.set(dy$LAYOUT, dy$OFFSET, fieldValue);
    }

    private static final OfFloat pressure$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("pressure"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float pressure
     * }
     */
    public static final OfFloat pressure$layout() {
        return pressure$LAYOUT;
    }

    private static final long pressure$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float pressure
     * }
     */
    public static final long pressure$offset() {
        return pressure$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float pressure
     * }
     */
    public static float pressure(MemorySegment struct) {
        return struct.get(pressure$LAYOUT, pressure$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float pressure
     * }
     */
    public static void pressure(MemorySegment struct, float fieldValue) {
        struct.set(pressure$LAYOUT, pressure$OFFSET, fieldValue);
    }

    private static final OfInt windowID$LAYOUT = (OfInt)$LAYOUT.select(groupElement("windowID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * SDL_WindowID windowID
     * }
     */
    public static final OfInt windowID$layout() {
        return windowID$LAYOUT;
    }

    private static final long windowID$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * SDL_WindowID windowID
     * }
     */
    public static final long windowID$offset() {
        return windowID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * SDL_WindowID windowID
     * }
     */
    public static int windowID(MemorySegment struct) {
        return struct.get(windowID$LAYOUT, windowID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * SDL_WindowID windowID
     * }
     */
    public static void windowID(MemorySegment struct, int fieldValue) {
        struct.set(windowID$LAYOUT, windowID$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

